---
kind: other
id: Methods.T:Autodesk.Revit.DB.SweptBlend
source: html/7b4c2226-e269-f9d9-d14d-394444cb822c.htm
---
# SweptBlend Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.